app/controllers/project_categories_controller.rb

SELECT "project_categories".* FROM "project_categories"
---
  def index
    @project_categories = ProjectCategory.all

UPDATE "project_categories" SET "description" = $1, "project_id" = $2, "updated_at" = $3 WHERE "project_categories"."id" = $4  [["description", "Category 2"], ["project_id", 2], ["updated_at", "2015-08-10 13:33:10.870405"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @project_category.update(project_category_params)

SELECT  "project_categories".* FROM "project_categories" WHERE "project_categories"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_project_category
      @project_category = ProjectCategory.find(params[:id])