app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "description", "company", "location", "supervisior", "manday", "workingweek", "holiday", "user_id", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
     #binding.pry
    @project = Project.new(project_params)

     if @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 2]]
---
  def update
      #binding.pry
      @project = Project.find(params[:id])